In [1]:
import numpy as np
import pandas as pd

new_york = pd.DataFrame(
    {
        'first_name': ['Bill', 'Meghan', 'Peter', 'Carlos', 'Milton', 'Bob', 'Bob'],
        'last_name': ['Lumbergh', 'Elliott', 'Gibbons', 'Garcia', 'waddams', 'Porter', 'Slydell'],
        'job_title': ['Manager', 'Programmer', 'Programmer', 'Programmer', 'Collator', 'Consultant', 'Consultant'],
        'hire_date': [1985, 1989, 1989, 1974, 1989, 1974, 1999],
        'Contact_number': ['555-245', '544-235', '555-234', '988-224', '876-244', '874-244', '789-764'],
    }
)
washington = pd.DataFrame(
    {
        'first_name': ['Gerardo', 'Andrea', 'Pedro', 'Vicente', 'Luis', 'Ramon', 'Geral'],
        'last_name': ['Perez', 'Ramirez', 'Villamediana', 'Ostos', 'Escalante', 'Elliott', 'Shome'],
        'job_title': ['Manager', 'Programmer', 'Programmer', 'Programmer', 'Collator', 'Consultant', 'Consultant'],
        'hire_date': [1985, 1995, 1985, 1974, 1974, 1985, 1999],
        'Contact_number': ['563-245', '544-342', '555-849', '462-245', '246-234', '264-536', '246-245'],
    }
)


def search_col(df, colname, query):
    return df[df[colname].str.contains(query)]


search_col(washington, "job_title", "Prog")


def search_cols(df, query):
    return df[
        df.apply(
            lambda row: row.astype(str).str.contains(query).any(),
            axis=1
        )]


search_cols(washington, "Prog")

  first_name     last_name   job_title  hire_date Contact_number
1     Andrea       Ramirez  Programmer       1995        544-342
2      Pedro  Villamediana  Programmer       1985        555-849
3    Vicente         Ostos  Programmer       1974        462-245

In [5]:
#Instantiation
#seld.data is the only attribute in this example
class MyList:
    def __init__(self,data):
       self.data = data
        
    def head(self, n=5):
        return self.data[:n]
    
    def tail(self, n=5):
        return self.data[-n:]
    
ml = MyList(list(range(9)))

ml.head()
ml.tail()

[4, 5, 6, 7, 8]